In [1]:
import pandas as pd

In [2]:
movies_rating = pd.read_csv('http://bit.ly/imdbratings')
movies_rating.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [11]:
#Hit shit + tap in method or function parenthesis to see the description
movies_rating.describe()
movies_rating.describe(include='int64')

         duration
count  979.000000
mean   120.979571
std     26.218010
min     64.000000
25%    102.000000
50%    117.000000
75%    134.000000
max    242.000000

In [9]:
type(movies_rating.shape)
movies_rating.shape

(979, 6)

In [10]:
movies_rating.dtypes
#type(movies_rating.dtypes)

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

# How to Rename a Columns in Pandas DataFrame

In [12]:
ufo_dataframe = pd.read_csv('http://bit.ly/uforeports')
ufo_dataframe.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [13]:
ufo_dataframe.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [15]:
ufo_dataframe.rename(columns={'Colors Reported':'Colors_Reported', 'Shape Reported' : 'Shape_Reported'},inplace=True)

In [16]:
ufo_dataframe.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

In [19]:
ufo_columns = ['City', 'Colors Reported', 'Shape Reported', 'State', 'Time']
ufo_dataframe.columns = ufo_columns
ufo_dataframe.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [22]:
ufo_columns = ['City', 'Colors Reported', 'Shape Reported', 'State', 'Time']

ufo_dataframe = pd.read_csv('http://bit.ly/uforeports',names=ufo_columns, header=0)
ufo_dataframe.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [23]:
ufo_dataframe.columns = ufo_dataframe.columns.str.replace(' ','_')
ufo_dataframe.head()

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

# How do I remove Columns from a Pandas DataFrame

In [26]:
ufo_dataframe.drop('Shape_Reported', axis=1, inplace=True)
ufo_dataframe.head()

                   City State             Time
0                Ithaca    NY   6/1/1930 22:00
1           Willingboro    NJ  6/30/1930 20:00
2               Holyoke    CO  2/15/1931 14:00
3               Abilene    KS   6/1/1931 13:00
4  New York Worlds Fair    NY  4/18/1933 19:00

In [27]:
ufo_dataframe.drop(['City','State'],axis=1,inplace=True)
ufo_dataframe.head()

              Time
0   6/1/1930 22:00
1  6/30/1930 20:00
2  2/15/1931 14:00
3   6/1/1931 13:00
4  4/18/1933 19:00

In [29]:
ufo_dataframe.drop([0,1], axis=0,inplace=True)
ufo_dataframe.head()

              Time
2  2/15/1931 14:00
3   6/1/1931 13:00
4  4/18/1933 19:00
5  9/15/1934 15:30
6   6/15/1935 0:00

# How do I sort a pandas DataFrame  or Series